// 字母验证
export const letterReg = /^[A-Za-z]+$ /;

// 验证汉字
export const chineseReg = /^[\u4e00-\u9fa5]{1,}$/;

// 手机正则
export const phoneReg = /^1[3|4|5|8][0-9]\d{4,8}$/;

// 固话 直辖市 3位-8位 (010-87651234), 普通市 4位-7位 (0517-3160234)
export const telReg = /(^0\d{2}-\d{8}$)|(^0\d{3}-\d{7}$)/;

// 邮箱
export const emailReg = /^[a-z0-9]+([._\\-]*[a-z0-9])*@([a-z0-9]+[-a-z0-9]*[a-z0-9]+.){1,63}[a-z0-9]+$/;

// 用户账号 由 4 到 16 位(字母，数字，下划线，减号)
export const authorReg = /^[a-zA-Z0-9_-]{4,16}$/;

// 密码强度 最少 8 位，包括至少 1 个大写字母，1 个小写字母，1 个数字，1 个特殊字符
export const passwordReg = /^.*(?=.{8,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/;

// 身份证
export const IDCardReg = /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/;
